In [1]:
import pandas as pd
import seaborn as sns

In [14]:
data = pd.read_csv("data/personal_train.csv")
data.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>name</th>
      <th>address</th>
      <th>age</th>
      <th>sex</th>
      <th>date_of_birth</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>Terry Terry</td>
      <td>11818 Lori Crossing Apt. 802\nPughstad, DC 78165</td>
      <td>64.0</td>
      <td>M</td>
      <td>1954-05-30 00:00:00</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>Edith Boudreaux</td>
      <td>PSC 4657, Box 5446\nAPO AP 58412</td>
      <td>37.0</td>
      <td>F</td>
      <td>1981-07-23 00:00:00</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2</td>
      <td>Janet Washington</td>
      <td>Unit 9759 Box 9470\nDPO AP 45549</td>
      <td>69.0</td>
      <td>F</td>
      <td>1949-02-16 00 00 00</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3</td>
      <td>Margaret Chabot</td>
      <td>137 Lewis Flat Suite 762\nWest Elizabeth, AL 3...</td>
      <td>78.0</td>
      <td>F</td>
      <td>1939-12-09</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4</td>
      <td>Colleen Satterwhite</td>
      <td>995 Frank Stravenue\nSouth Matthewport, TX 81402</td>
      <td>34.0</td>
      <td>F</td>
      <td>1984-02-15</td>
    </tr>
  </tbody>
</table>
</div>

# Dataset personal_train.csv
Mat ulozeny vek je zbytocne ak mame datum narodenia  
Datumy narodenia su v roznych formatoch (niektore maju aj cas, ktory nepotrebujeme)  
Novy riadok v adrese?  
Prvy stlpec by mohol mat aspon nejaky nazov (vyzera to na nejake id)

In [15]:
data.describe()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>age</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>2237.000000</td>
      <td>2236.000000</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>1118.000000</td>
      <td>46.155635</td>
    </tr>
    <tr>
      <th>std</th>
      <td>645.910598</td>
      <td>1693.680216</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.000000</td>
      <td>-8900.000000</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>559.000000</td>
      <td>35.000000</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>1118.000000</td>
      <td>54.000000</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>1677.000000</td>
      <td>69.000000</td>
    </tr>
    <tr>
      <th>max</th>
      <td>2236.000000</td>
      <td>8900.000000</td>
    </tr>
  </tbody>
</table>
</div>

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2237 entries, 0 to 2236
Data columns (total 6 columns):
Unnamed: 0       2237 non-null int64
name             2237 non-null object
address          2237 non-null object
age              2236 non-null float64
sex              2237 non-null object
date_of_birth    2236 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 104.9+ KB